src/Catalogs/МетодыРесурсовREST/МетодыРесурсовREST.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МетодыРесурсовREST</name>
  <owners>Catalog.РесурсыREST</owners>
  <attributes>
    <name>МетодЗапроса</name>
    <type>
      <types>EnumRef.МетодыЗапросаREST</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпределениеОбъекта</name>
    <type>
      <types>CatalogRef.СтруктурыДанныхREST</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаголовкиЗапроса</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КраткоеОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОпределениеОбъекта</name>
      <type>
        <types>CatalogRef.СтруктурыДанныхREST</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЗапроса</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КраткоеОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОпределениеОбъекта</name>
      <type>
        <types>CatalogRef.СтруктурыДанныхREST</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвращаемыеОтветы</name>
    <attributes>
      <name>ТипОтвета</name>
      <type>
        <types>EnumRef.ТипыОтветовREST</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОтвета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КраткоеОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОпределениеОбъекта</name>
      <type>
        <types>CatalogRef.СтруктурыДанныхREST</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаголовкиОтвета</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КраткоеОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/МетодыРесурсовREST/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.Владелец.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	УстановитьВидимость();
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвторизацияПриИзменении(Элемент)
	
	Объект.Доступ.Очистить();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	Объект.ОпределениеОбъекта = Неопределено;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвращаемыеОтветы

&НаКлиенте
Процедура ВозвращаемыеОтветыТипОтветаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВозвращаемыеОтветы.ТекущиеДанные;
	
	ЭлементСписка = ПользовательскиеВидыОтветов.НайтиПоЗначению(ТекущиеДанные.ТипОтвета);
	
	Если ЭлементСписка = Неопределено Тогда
		ТекущиеДанные.КодОтвета = 0;
	Иначе
		ТекущиеДанные.КодОтвета = Число(ЭлементСписка.Представление);
	КонецЕсли;
	
	Если Окр(ТекущиеДанные.КодОтвета / 100) <> 2 Тогда
		ТекущиеДанные.ТипДанных = "Строка";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСпискиВыбора()
	
	//
	ДоступныеТипыДанных = СпецификацияREST.ПолучитьДоступныеТипыДанныхПараметра();
	
	Элементы.ЗаголовкиЗапросаТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	Элементы.ПараметрыЗапросаТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	Элементы.ЗаголовкиОтветаТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	
	//
	ПользовательскиеВидыОтветов = ОбщегоНазначенияREST.ПолучитьПользовательскиеВидыОтветов();
	
	Элементы.ВозвращаемыеОтветыТипОтвета.СписокВыбора.ЗагрузитьЗначения(ПользовательскиеВидыОтветов.ВыгрузитьЗначения());
	
	//
	ДоступныеТипыДанных = СпецификацияREST.ПолучитьДоступныеТипыДанныхТела();
	
	Элементы.ТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	Элементы.ВозвращаемыеОтветыТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ОпределениеОбъекта.Видимость = (Объект.ТипДанных = "Объект" Или Объект.ТипДанных = "Массив");
	
	Элементы.ГруппаДоступ.Видимость = (Объект.ЕстьАвторизация);
	
КонецПроцедуры

#КонецОбласти
